Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationHangerSizeNotMatch Property
 The hanger size does not match the size of the host, so it can not be connected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationHangerSizeNotMatch { get; }
Public Shared ReadOnly Property FabricationHangerSizeNotMatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationHangerSizeNotMatch {
	FailureDefinitionId^ get ();
}
static member FabricationHangerSizeNotMatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace